RT-Thread/rt-thread/bsp/efm32/drv_usart.c
    if (--usart->counter == 0)
    {
        if (dev->flag & RT_DEVICE_FLAG_INT_RX)
        {
            struct efm32_usart_int_mode_t *int_rx;

            int_rx = (struct efm32_usart_int_mode_t *)usart->rx_mode;

            rt_free(int_rx->data_ptr);
            int_rx->data_ptr = RT_NULL;
        }
    }

    return RT_EOK;
}

/***************************************************************************//**
 * @brief
 *  Read from USART device
 *
 * @details
 *
 * @note
 *  9-bit SPI mode and SPI slave mode is untested
 *
 * @param[in] dev
 *  Pointer to device descriptor
 *
 * @param[in] pos
 *  Offset
 *
 * @param[in] buffer
 *  Poniter to the buffer
 *
 * @param[in] size
 *  Buffer size in byte
 *
 * @return
 *  Number of read bytes
 ******************************************************************************/
static rt_size_t rt_usart_read (
    rt_device_t     dev,
    rt_off_t        pos,
    void            *buffer,
    rt_size_t       size)
{
    struct efm32_usart_device_t *usart;
    rt_uint8_t  *ptr;
    rt_err_t    err_code;
    rt_size_t   read_len;
    rt_uint32_t rx_flag, tx_flag, b8_flag;

    usart = (struct efm32_usart_device_t *)(dev->user_data);
#if defined(UART_PRESENT)
    if (usart->state & USART_STATE_ASYNC_ONLY)
    {
        rx_flag = UART_STATUS_RXDATAV;
        tx_flag = UART_STATUS_TXBL;
        b8_flag = UART_CTRL_BIT8DV;
    }
    else
#endif
    {
        rx_flag = USART_STATUS_RXDATAV;
        tx_flag = USART_STATUS_TXBL;
        b8_flag = USART_CTRL_BIT8DV;
    }

    /* Lock device */
    if (rt_hw_interrupt_check())
    {
        err_code = rt_sem_take(usart->lock, RT_WAITING_NO);
    }
    else
    {
        err_code = rt_sem_take(usart->lock, RT_WAITING_FOREVER);
    }
    if (err_code != RT_EOK)
    {
        rt_set_errno(err_code);
        return 0;
    }

    if (dev->flag & RT_DEVICE_FLAG_INT_RX)
    {
        rt_size_t len = size;
        ptr = buffer;

        /* interrupt mode Rx */
        while (len)
        {
            rt_base_t level;
            struct efm32_usart_int_mode_t *int_rx;

            int_rx = (struct efm32_usart_int_mode_t *)\
                (((struct efm32_usart_device_t *)(dev->user_data))->rx_mode);

            /* disable interrupt */
            level = rt_hw_interrupt_disable();

            if (int_rx->read_index != int_rx->save_index)
            {
                /* read a character */
                *ptr++ = int_rx->data_ptr[int_rx->read_index];
                len--;

                /* move to next position */
                int_rx->read_index ++;
                if (int_rx->read_index >= USART_RX_BUFFER_SIZE)
                {
                    int_rx->read_index = 0;
                }
            }
            else
            {
                /* set error code */
                err_code = -RT_EEMPTY;

                /* enable interrupt */
                rt_hw_interrupt_enable(level);
                break;
            }

            /* enable interrupt */
            rt_hw_interrupt_enable(level);
        }

        read_len = (rt_uint32_t)ptr - (rt_uint32_t)buffer;
    }
    else
    {
        struct efm32_usart_device_t *usart;
        USART_TypeDef *usart_device;
        rt_size_t len;

        usart = (struct efm32_usart_device_t *)(dev->user_data);
        usart_device = ((struct efm32_usart_device_t *)(dev->user_data))->usart_device;

        if (usart->state & USART_STATE_SYNC)
        {
            /* SPI read */
            rt_uint8_t inst_len = *((rt_uint8_t *)buffer);
            rt_uint8_t *inst_ptr = (rt_uint8_t *)(buffer + 1);
            rt_uint8_t *rx_buf = *((rt_uint8_t **)(buffer + inst_len + 1));
            rt_off_t i;

            ptr = rx_buf;
            len = inst_len;

            /* Write instructions */
            if (len)
            {
                if (usart->state & USART_STATE_9BIT)
                {
                    usart_device->CTRL &= ~b8_flag;
                }
                while (len)
                {
                    while (!(usart->usart_device->STATUS & tx_flag));
                    usart->usart_device->TXDATA = (rt_uint32_t)*inst_ptr;
                    ++inst_ptr; --len;
                }
                if (usart->state & USART_STATE_9BIT)
                {
                    usart_device->CTRL |= b8_flag;
                }
            }
            /* Flushing RX */
            usart_device->CMD = USART_CMD_CLEARRX;
            /* Skip some bytes if necessary */
            for (i = 0; i < pos; i++)
            {
                /* dummy write */
                while (!(usart_device->STATUS & tx_flag));
                usart_device->TXDATA = (rt_uint32_t)0xff;
                /* dummy read */
                while (!(usart_device->STATUS & rx_flag));
                *((rt_uint32_t *)0x00) = usart_device->RXDATA;
            }
            /* Read data */
            while (((rt_uint32_t)ptr - (rt_uint32_t)rx_buf) < size)
            {
                /* dummy write */
                while (!(usart_device->STATUS & tx_flag));
                usart_device->TXDATA = (rt_uint32_t)0xff;
                /* read a byte of data */
                while (!(usart_device->STATUS & rx_flag));
                *ptr = usart_device->RXDATA & 0xff;
                ptr ++;
            }
        }
        else
        {
            ptr = buffer;

            /* polling mode */
            while ((rt_uint32_t)ptr - (rt_uint32_t)buffer < size)
            {
                while (usart_device->STATUS & rx_flag)
                {
                    *ptr = usart_device->RXDATA & 0xff;
                    ptr ++;
                }
            }
        }

        read_len = size;
    }

    /* Unlock device */
    rt_sem_release(usart->lock);

    /* set error code */
    rt_set_errno(err_code);
    return read_len;
}

/***************************************************************************//**
 * @brief
 *   Write to USART device
 *
 * @details
 *
 * @note
 *
 * @param[in] dev
 *   Pointer to device descriptor
 *
 * @param[in] pos
 *   Offset
 *
 * @param[in] buffer
 *   Poniter to the buffer
 *
 * @param[in] size
 *   Buffer size in byte
 *
 * @return
 *   Number of written bytes
 ******************************************************************************/
static rt_size_t rt_usart_write (
    rt_device_t     dev,
    rt_off_t        pos,
    const void*     buffer,
    rt_size_t       size)
{
    rt_err_t err_code;
    rt_size_t write_size = 0;
    struct efm32_usart_device_t* usart = (struct efm32_usart_device_t*)(dev->user_data);
    rt_uint8_t *tx_buf;
    rt_uint32_t tx_flag, b8_flag;

#if defined(UART_PRESENT)
    if (usart->state & USART_STATE_ASYNC_ONLY)
    {
        tx_flag = UART_STATUS_TXBL;
        b8_flag = UART_CTRL_BIT8DV;
    }
    else
#endif
    {
        tx_flag = USART_STATUS_TXBL;
        b8_flag = USART_CTRL_BIT8DV;
    }

    /* Lock device */
    if (rt_hw_interrupt_check())
    {
        err_code = rt_sem_take(usart->lock, RT_WAITING_NO);
    }
    else
    {
        err_code = rt_sem_take(usart->lock, RT_WAITING_FOREVER);
    }
    if (err_code != RT_EOK)
    {
        rt_set_errno(err_code);
        return 0;
    }

