RT-Thread/rt-thread/bsp/efm32/drv_usart.c
    if (usart->state & USART_STATE_SYNC)
    {   /* SPI write */
        rt_uint8_t inst_len     = *((rt_uint8_t *)buffer);
        rt_uint8_t *inst_ptr    = (rt_uint8_t *)(buffer + 1);
        tx_buf = *((rt_uint8_t **)(buffer + inst_len + 1));

        /* Write instructions */
        if (inst_len)
        {
            if (usart->state & USART_STATE_9BIT)
            {
                usart->usart_device->CTRL &= ~b8_flag;
            }
            if ((dev->flag & RT_DEVICE_FLAG_DMA_TX) && (inst_len > 2))
            {   /* DMA mode Tx */
                struct efm32_usart_dma_mode_t *dma_tx;

                usart_debug("USART: DMA TX INS (%d)\n", inst_len);
                dma_tx = (struct efm32_usart_dma_mode_t *)(usart->tx_mode);
                dma_tx->data_ptr = (rt_uint32_t *)inst_ptr;
                dma_tx->data_size = inst_len;

                usart->state |= USART_STATE_TX_BUSY;
                DMA_ActivateBasic(
                    dma_tx->dma_channel,
                    true,
                    false,
                    (void *)&(usart->usart_device->TXDATA),
                    (void *)inst_ptr,
                    (rt_uint32_t)(inst_len - 1));
                /* Wait, otherwise the TX buffer is overwrite */
                // TODO: This function blocks the process => goto low power mode?
        //      if (usart->state & USART_STATE_CONSOLE)
        //      {
                    while(usart->state & USART_STATE_TX_BUSY);
        //      }
        //      else
        //      {
        //          while(usart->state & USART_STATE_TX_BUSY)
        //          {
        //              rt_thread_sleep(USART_WAIT_TIME_TX);
        //          }
        //      }
            }
            else
            {   /* polling mode */
                rt_uint8_t *ptr = (rt_uint8_t *)inst_ptr;
                rt_size_t len = inst_len;

                usart_debug("USART: Polling TX INS (%d)\n", inst_len);
                while (len)
                {
                    while (!(usart->usart_device->STATUS & tx_flag));
                    usart->usart_device->TXDATA = (rt_uint32_t)*ptr;
                    ++ptr; --len;
                }
            }
            if (usart->state & USART_STATE_9BIT)
            {
                usart->usart_device->CTRL |= b8_flag;
            }
        }
    }
    else
    {
        tx_buf = (rt_uint8_t *)buffer;
    }

    /* Write data */
    if (dev->flag & RT_DEVICE_FLAG_STREAM)
    {
        if (*(tx_buf + size - 1) == '\n')
        {
            *(tx_buf + size - 1) = '\r';
            *(tx_buf + size++) = '\n';
            *(tx_buf + size) = 0;
        }
    }
    if ((dev->flag & RT_DEVICE_FLAG_DMA_TX) && (size > 2))
    {   /* DMA mode Tx */
        struct efm32_usart_dma_mode_t *dma_tx;

        usart_debug("USART: DMA TX data (%d)\n", size);
        dma_tx = (struct efm32_usart_dma_mode_t *)(usart->tx_mode);
        dma_tx->data_ptr = (rt_uint32_t *)tx_buf;
        dma_tx->data_size = size;

        usart->state |= USART_STATE_TX_BUSY;
        DMA_ActivateBasic(
            dma_tx->dma_channel,
            true,
            false,
            (void *)&(usart->usart_device->TXDATA),
            (void *)tx_buf,
            (rt_uint32_t)(size - 1));

        /* Wait, otherwise the TX buffer is overwrite */
        // TODO: This function blocks the process => goto low power mode?
//      if (usart->state & USART_STATE_CONSOLE)
//      {
            while(usart->state & USART_STATE_TX_BUSY);
//      }
//      else
//      {
//          while(usart->state & USART_STATE_TX_BUSY)
//          {
//              rt_thread_sleep(USART_WAIT_TIME_TX);
//          }
//      }
        write_size = size;
    }
    else
    {   /* polling mode */
        rt_uint8_t *ptr = (rt_uint8_t *)tx_buf;
        rt_size_t len = size;

        usart_debug("USART: Polling TX data (%d)\n", size);
        while (len)
        {
            while (!(usart->usart_device->STATUS & tx_flag));
            usart->usart_device->TXDATA = (rt_uint32_t)*ptr;
            ++ptr; --len;
        }

        write_size = (rt_size_t)ptr - (rt_size_t)tx_buf;
    }

    /* Unlock device */
    rt_sem_release(usart->lock);

    /* set error code */
    rt_set_errno(err_code);
    return write_size;
}

/***************************************************************************//**
* @brief
*   Configure USART device
*
* @details
*
* @note
*
* @param[in] dev
*   Pointer to device descriptor
*
* @param[in] cmd
*   IIC control command
*
* @param[in] args
*   Arguments
*
* @return
*   Error code
******************************************************************************/
static rt_err_t rt_usart_control (
    rt_device_t     dev,
    rt_uint8_t      cmd,
    void            *args)
{
    RT_ASSERT(dev != RT_NULL);

    rt_err_t    err_code;
    struct efm32_usart_device_t *usart;

    usart = (struct efm32_usart_device_t *)(dev->user_data);

    /* Lock device */
    if (rt_hw_interrupt_check())
    {
        err_code = rt_sem_take(usart->lock, RT_WAITING_NO);
    }
    else
    {
        err_code = rt_sem_take(usart->lock, RT_WAITING_FOREVER);
    }
    if (err_code != RT_EOK)
    {
        return err_code;
    }

    switch (cmd)
    {
    case RT_DEVICE_CTRL_SUSPEND:
        /* Suspend device */
        dev->flag |= RT_DEVICE_FLAG_SUSPENDED;
        USART_Enable(usart->usart_device, usartDisable);
        break;

    case RT_DEVICE_CTRL_RESUME:
        /* Resume device */
        dev->flag &= ~RT_DEVICE_FLAG_SUSPENDED;
        USART_Enable(usart->usart_device, usartEnable);
        break;

    case RT_DEVICE_CTRL_USART_RBUFFER:
        /* Set RX buffer */
        {
            struct efm32_usart_int_mode_t *int_rx;
            rt_uint8_t size;

            int_rx = (struct efm32_usart_int_mode_t *)(usart->rx_mode);
            size = (rt_uint8_t)((rt_uint32_t)args & 0xFFUL);

            /* Free previous RX buffer */
            if (int_rx->data_ptr != RT_NULL)
            {
                if (size == 0)
                {   /* Free RX buffer */
                    rt_free(int_rx->data_ptr);
                    int_rx->data_ptr = RT_NULL;
                }
                else if (size != int_rx->data_size)
                {
                    /* Re-allocate RX buffer */
                    if ((int_rx->data_ptr = rt_realloc(int_rx->data_ptr, size)) \
                        == RT_NULL)
                    {
                        usart_debug("USART%d err: no mem for RX BUF\n", usart->unit);
                        err_code = -RT_ENOMEM;
                        break;
                    }
                    // TODO: Is the following line necessary?
                    //rt_memset(int_rx->data_ptr, 0, size);
                }
            }
            else
            {
                /* Allocate new RX buffer */
                if ((int_rx->data_ptr = rt_malloc(size)) == RT_NULL)
                {
                    usart_debug("USART%d err: no mem for RX BUF\n", usart->unit);
                    err_code = -RT_ENOMEM;
                    break;
                }
            }
            int_rx->data_size = size;
            int_rx->read_index = 0;
            int_rx->save_index = 0;
        }
        break;

